
  #### Terraform Format🖌: `success`
  #### Terraform Init⚙️: `success`
  #### Terraform Validate🤖: `success`
  #### Terraform Plan📖: `success`

  <details><summary>Plan Details</summary>

  ```bash
  portainer_stack.stacks["busybox"]: Refreshing state... [id=102]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # portainer_stack.stacks["busybox"] will be destroyed
  # (because portainer_stack.stacks is not in configuration)
  - resource "portainer_stack" "stacks" {
      - compose_format                = false -> null
      - deployment_type               = "swarm" -> null
      - endpoint_id                   = 1 -> null
      - file_path_in_repository       = "stacks/busybox/compose.yml" -> null
      - force_update                  = false -> null
      - git_repository_authentication = false -> null
      - id                            = "102" -> null
      - method                        = "repository" -> null
      - name                          = "busybox" -> null
      - prune                         = false -> null
      - pull_image                    = false -> null
      - repository_reference_name     = "refs/heads/main" -> null
      - repository_url                = "https://github.com/ggmanugg/homelab_terra" -> null
      - stack_webhook                 = false -> null
      - support_relative_path         = false -> null
      - swarm_id                      = "wgnc0qkevacvb2dqpsauvlbi3" -> null
      - tlsskip_verify                = false -> null
        # (1 unchanged attribute hidden)
    }

  # portainer_stack.vse002-swarm["rustdesk"] will be created
  + resource "portainer_stack" "vse002-swarm" {
      + compose_format                = false
      + deployment_type               = "swarm"
      + endpoint_id                   = 1
      + file_path_in_repository       = "stacks/rustdesk/compose.yml"
      + force_update                  = false
      + git_repository_authentication = false
      + id                            = (known after apply)
      + method                        = "repository"
      + name                          = "rustdesk"
      + prune                         = false
      + pull_image                    = false
      + repository_reference_name     = "refs/heads/main"
      + repository_url                = "https://github.com/ggmanugg/homelab_terra"
      + stack_webhook                 = false
      + support_relative_path         = false
      + swarm_id                      = (known after apply)
      + tlsskip_verify                = false
      + webhook_id                    = (known after apply)
      + webhook_url                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

  ```

  </details>

  *Run by @ggmanugg via `pull_request`*
